<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------
// $Id$
return [

    // 模板参数替换
    'view_replace_str'       => array(
        '__CSS__'    => '/public/static/admin/css',
        '__JS__'     => '/public/static/admin/js',
        '__IMG__' => '/public/static/admin/images',
    ),

    // 管理员状态
    'user_status' => [
        '1' => '正常',
        '2' => '禁用'
    ],
    // 角色状态
    'role_status' => [
        '1' => '启用',
        '2' => '禁用'
    ],

    'static' => [
        '1' => '待审核',
        '2' => '生产中',
        '3' => '审核失败',
        '4' => '生产中-手工',
        '5' => '业务员审核',
        '6' => '订单完成'
    ],

    'debuff' => [ 
         '2' => '订单超时'
    ],

    'uptime' => [
        '上午' => '11:30',
        '下午' => '17:00',
        '晚上' => '20:00'
   ],

    // 多库测试
    'local' => [
        // 数据库类型
        'type'        => 'mysql',
        // 服务器地址
        'hostname'    => '127.0.0.1',
        // 数据库名
        'database'    => 'test',
        // 数据库用户名
        'username'    => 'root',
        // 数据库密码
        'password'    => 'root',
        // 数据库编码默认采用utf8
        'charset'     => 'utf8',
        // 数据库表前缀
        'prefix'      => '',
    ],
];
